ejercicios/ejercicios_tema5.tex
% Created 2022-04-19 mar 23:08
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{color}
\usepackage{listings}
\usepackage[margin=2.5cm]{geometry}
\usepackage[spanish]{babel}
\usepackage[usenames,svgnames,dvipsnames]{xcolor}
\usepackage{listings}
\lstset{keywordstyle=\color{blue}, commentstyle=\color{gray!90}, basicstyle=\ttfamily\small, columns=fullflexible, breaklines=true,linewidth=\textwidth, backgroundcolor=\color{gray!23}, basewidth={0.5em,0.4em}, literate={¡}{{\textexclamdown}}1 {á}{{\'a}}1 {ñ}{{\~n}}1 {é}{{\'e}}1 {ó}{{\'o}}1 {í}{{\'i}}1 {ú}{{\'u}}1 {º}{{\textordmasculine}}1, showstringspaces=false}
\usepackage{mathpazo}
\hypersetup{colorlinks=true, linkcolor=Blue, urlcolor=Blue}
\usepackage{fancyvrb}
\DefineVerbatimEnvironment{verbatim}{Verbatim}{fontsize=\tiny, formatcom = {\color{black!70}}}
\date{}
\title{Ejercicios del Tema 5\\\medskip
\large Punteros}
\hypersetup{
 pdfauthor={},
 pdftitle={Ejercicios del Tema 5},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.4.6)}, 
 pdflang={Spanish}}
\begin{document}

\maketitle


\section{Cambio de dos variables}
\label{sec:org96e3612}

Escribe un programa que, con una función que trabaja con el paso por referencia, intercambia el valor de dos variables. Emplea el siguiente prototipo:

\lstset{language=C,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
void cambio (int *p, int *q);
\end{lstlisting}


\section{Suma de un vector}
\label{sec:org50becca}

Diseña un programa que calcule la suma de un vector usando una función basada en punteros.

\lstset{language=C,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
int sumaVector(int *vector, int n);
\end{lstlisting}

\section{Suma minutos}
\label{sec:orgaa6208b}
Construye un programa que añada un incremento en minutos a una hora dada en horas y minutos. Este programa utilizará una función según el siguiente prototipo. 

\lstset{language=C,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
int incHora(int *h, int *m, int inc);
\end{lstlisting}
Al hacer la modificación, esta función deberá respetar que las horas estén entre 0 y 23, y los minutos entre 0 y 59. Además, la función devolverá 1 si el incremento ha supuesto cambio de un día a otro, o 0 en caso contrario.

El programa recibirá por teclado los valores de hora, minutos y el incremento, y mostrará en pantalla el resultado.


\section{Ecuación de segundo grado}
\label{sec:org1c83fa8}

Escribe un programa que resuelva una ecuación de segundo grado. En primer lugar, debe solicitar al usuario los coeficientes de la ecuación. A continuación, debe resolver la ecuación indicando el tipo de resultado: dos raíces reales, dos raíces complejas conjugadas, una raíz real doble, ecuación lineal, o error en los coeficientes. Debes usar el siguiente prototipo:

\lstset{language=C,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
int raices(float a, float b, float c, float *r1, float *r2);
\end{lstlisting}

donde \texttt{r1} y \texttt{r2} son las raíces de la ecuación, y la salida \texttt{int} se emplea para indicar el tipo de ecuación.

\section{Suma, resta, producto y división de dos números}
\label{sec:orge2c38ab}
Escribe un programa que calcule la suma, la resta, el producto, y la división (entregando 0 en caso de división por cero) de dos números reales, utilizando una función según el siguiente prototipo:

\lstset{language=C,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
int foo(float x, float y, float *suma, float *resta, float *prod, float *div);
\end{lstlisting}
Además del resultado de las operaciones, esta función devolverá 1 si el número x es mayor que y, -1 si x es menor que y, 0 si son iguales.
El programa recibirá por teclado el valor de x e y, y mostrará en pantalla los resultados de las operaciones y el indicador de mayor o menor.


\section{Cuadrantes}
\label{sec:orgef47f72}
Realice un programa que calcule la distancia entre dos puntos introducidos por el usuario mediante el teclado, y que decida el cuadrante en el que está localizado cada punto. El programa debe recibir por teclado las coordenadas x e y de cada punto, sin escribir ningún mensaje en pantalla. A continuación debe calcular la distancia entre los puntos, y el cuadrante de cada uno de ellos, con una función según el siguiente prototipo:

\lstset{language=C,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
void detPunto(float p1[], float p2[], float *dist, int *cuad1, int *cuad2);
\end{lstlisting}

En esta función, \texttt{p1} es el primer punto, \texttt{p2} el segundo, \texttt{dist} es la distancia entre los puntos, \texttt{cuad1} el cuadrante del primer punto y \texttt{cuad2} el  cuadrante del segundo punto.

Finalmente, mostrará en pantalla los resultados en ese orden separados por un espacio.

\section{Media, máximo y mínimo de un vector de datos}
\label{sec:org433e1a2}

Escribe un programa que calcule el valor medio, el valor máximo y el valor mínimo de los datos contenidos en un vector de números reales empleando punteros. La función de cálculo debe acomodarse al siguiente prototipo:

\lstset{language=C,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
void stats(float *vector, int n, float *media, float *max, float *min);
\end{lstlisting}

Debes escribir dos versiones diferentes. La primera versión trabajará con un vector de dimensión fija y conocida (p.ej. 5 elementos). La segunda versión debe emplear asignación dinámica de memoria, siguiendo el mismo itinerario que el ejercicio anterior.

\emph{Nota: Este ejercicio es equivalente al ejercicio 6 del capítulo 4 (vectores). En aquel caso se usa notación de vectores, y ahora se debe emplear notación de punteros. Además, allí se usan tres funciones independientes, y ahora se debe usar una única función que entrega los tres resultados.}

\section{Longitud de una cadena de caracteres}
\label{sec:org3d87f58}

Diseña un programa que calcule la longitud de una cadena de caracteres usando una función basada en punteros.

\lstset{language=C,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
int stringLength(char *string);
\end{lstlisting}

\section{Copia de cadenas de caracteres}
\label{sec:org5d53a49}

Diseña un programa que copie dos cadenas de caracteres usando una función basada en punteros. Esta función imita el comportamiento de la función \texttt{strcpy} de la librería \texttt{string.h} (véase el capítulo 4, diapositiva 40).

\lstset{language=C,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
void copyString(char *to, char *from);
\end{lstlisting}

\section{Movimiento de un punto (estructura)}
\label{sec:org6710acc}

Construye un programa que sirva para mover un punto contenido en el plano (usando un tipo de datos \texttt{punto}) usando funciones basada en punteros a la estructura \texttt{punto}. El programa funciona con la interacción del usuario a partir de las teclas 'w' (arriba), 'a' (izquierda), 'x' (abajo), 'd' (derecha), y sus correspondientes mayúsculas. Por ejemplo, si el usuario aprieta la tecla 'w' el punto se desplaza hacia arriba una unidad, y si aprieta 'W' se desplaza cinco unidades hacia arriba. El programa muestra en pantalla las coordenadas del punto tras cada interacción del usuario.
El programa termina cuando el usuario pulsa la tecla 'q'.

\lstset{language=C,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
// Función para controlar el desplazamiento horizontal, siendo xy el
// punto, y n el número de unidades a desplazar
void horizontal(punto *xy, int n);
// Función para controlar el desplazamiento vertical
void vertical(punto *xy, int n);
\end{lstlisting}

\section{Asignación dinámica de memoria}
\label{sec:org44a6b01}
Escribe un programa que permita al usuario rellenar un vector de dimensión variable. En primer lugar, el programa pregunta al usuario el número de elementos que tendrá el vector. A continuación, empleando asignación dinámica de memoria, el programa reservará memoria para este vector, y solicitará al usuario los valores del mismo. Finalmente, el programa mostrará el contenido de este vector.

\section{Estaciones agroclimáticas}
\label{sec:org9b45b29}

Escriba un programa capaz de procesar información básica de unas estaciones agroclimáticas. Aunque lo habitual es que la información esté disponible en un fichero, en este ejercicio la información será introducida por teclado. En primer lugar, el usuario introducirá el número de estaciones disponibles. A continuación introducirá la información de cada estación separando por punto y coma los datos. 

La información de una estación es: identificador numérico, longitud, latitud, y altitud.  A partir de esta información el programa debe determinar:
\begin{itemize}
\item La estación (representada por su identificador, su longitud y su latitud) situada más al norte (máximo valor de latitud).
\item El valor promedio de la altura de todas las estaciones.
\end{itemize}

El programa terminará mostrando estos resultados en pantalla.
\end{document}